In [4]:
import pandas as pd
import numpy as np
d = {'c1': pd.Series(['A', 'B', 'C']),    
      'c2': pd.Series([1, 2., 3., 4.])}

In [5]:
d

{'c1': 0    A
 1    B
 2    C
 dtype: object, 'c2': 0    1.0
 1    2.0
 2    3.0
 3    4.0
 dtype: float64}

In [6]:
df=pd.DataFrame(d)

In [7]:
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [7]:
df.to_csv('sample_data.csv')

In [8]:
d=pd.read_csv('sample_data.csv')

In [9]:
d[0:4]

   Unnamed: 0   c1   c2
0           0    A  1.0
1           1    B  2.0
2           2    C  3.0
3           3  NaN  4.0

In [10]:
d = {'c1': pd.Series(['A', 'B', 'C']),    
      'c2': pd.Series([1, 2., 3., 4.])}

In [11]:
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [12]:
df.to_excel('sample_data.xls')

In [13]:
d=pd.read_excel('sample_data.xls')

In [14]:
d

   Unnamed: 0   c1  c2
0           0    A   1
1           1    B   2
2           2    C   3
3           3  NaN   4

In [8]:
import json

In [9]:
df.to_json('sample_data.json')

In [10]:
jdata=open('sample_data.json')

In [11]:
jdata

In [12]:
data=json.load(jdata)

In [13]:
data

{'c1': {'0': 'A', '1': 'B', '2': 'C', '3': None},
 'c2': {'0': 1.0, '1': 2.0, '2': 3.0, '3': 4.0}}

In [21]:
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [22]:
jdata.close()

In [23]:
data

{'c1': {'0': 'A', '1': 'B', '2': 'C', '3': None},
 'c2': {'0': 1.0, '1': 2.0, '2': 3.0, '3': 4.0}}

In [24]:
pd.read_json('sample_data.json')

     c1  c2
0     A   1
1     B   2
2     C   3
3  None   4